using System;
using System.Collections.Generic;
using System.Text;

namespace NewEva.Model
{
    public class LocalStorage
    {
        public static IEnumerable<string> TypeCosts =>
            new string[]
            {
                "Определение рыночной стоимости",
                "Определение рыночной и ликвидационной стоимостей объекта оценки для целей ипотечной сделки",
                "Определение рыночной и ликвидационной стоимостей имущества для предоставления в органы опеки и попечительства",
                "Определение рыночной и ликвидационной стоимостей имущества для предоставления в судебные органы",
                "Определение рыночной и ликвидационной стоимостей имущества для рефинансирования",
                "Определение рыночной и ликвидационной стоимостей имущества для принятия управленческих решений",
                "Для целей контроля качества и оценки ликвидности объектов недвижимости, находящихся в залоге",
                "Определение рыночной и ликвидационной стоимостей объекта оценки для целей залога",
                "Определение рыночной стоимости для целей залога",
                "Определение инвестиционной стоимости",
                "Определение ликвидационной стоимости"
            };
        public static IEnumerable<string> Appraisers =>
            new string[]
            {
                "Дельвиг Антон Денисович",
                "Рошка Андрей Ильевич",
                "Шестаков Денис Александрович"
            };
        public static IEnumerable<string> TypeAttorney =>
            new string[]
            {
                "Устава",
                "Доверенности",
                "Закона"
            };
    }
}
